# Exploratory Data Analysis

In [2]:
import os
from pathlib import Path
import pandas as pd

In [3]:
ROOT = Path(os.path.abspath('')).resolve().parents[0]
FIGURES_PATH = os.path.join(ROOT, 'reports', 'figures')
DATA = os.path.join(ROOT, "data")

In [5]:
df = pd.read_csv(os.path.join(DATA, 'transactions_fr.csv'), sep=";",
            quotechar='"',
            decimal=",",
            parse_dates=["timestamp"])

In [6]:
df

,id,description,amount,timestamp,merchant,operation_type,side
0,1,Card expense at EDF,-952.40,2023-11-28 06:35:12,EDF,refund,debit
1,2,Purchase at Amazon.fr,-749.56,2023-05-16 01:27:52,Amazon.fr,transfer,debit
2,3,Receipt from Darty,184.91,2023-11-03 11:49:37,Darty,refund,credit
3,4,Incoming transfer,-980.93,2023-06-23 16:24:44,La Poste,direct_debit,debit
4,5,Outgoing transfer,740.58,2024-01-20 01:41:47,Auchan,refund,credit
...,...,...,...,...,...,...,...
9995,9996,Subscription to Orange,1440.16,2023-12-13 20:40:49,Orange,refund,credit
9996,9997,Subscription to EDF,1928.99,2023-01-06 14:01:32,EDF,refund,credit
9997,9998,Outgoing transfer,-1163.01,2023-11-16 10:08:31,Veolia,payment,debit
9998,9999,Card expense at RATP,-624.93,2023-03-25 07:37:43,RATP,direct_debit,debit
9999,10000,Direct debit,-29.34,2023-05-14 17:08:57,Uber,direct_debit,debit

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              10000 non-null  int64
 1   description     10000 non-null  object
 2   amount          10000 non-null  float64
 3   timestamp       10000 non-null  datetime64[ns]
 4   merchant        10000 non-null  object
 5   operation_type  10000 non-null  object
 6   side            10000 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(1), object(4)
memory usage: 547.0+ KB

In [8]:
df.describe()

                id        amount                      timestamp
count  10000.00000  10000.000000                          10000
mean    5000.50000    233.007967     2023-08-28 05:31:48.613600
min        1.00000  -1999.870000            2023-01-01 00:08:45
25%     2500.75000  -1259.472500     2023-04-28 04:52:47.500000
50%     5000.50000   -469.330000     2023-08-27 00:21:54.500000
75%     7500.25000   1449.872500  2023-12-26 15:52:15.249999872
max    10000.00000   4996.160000            2024-04-24 22:37:06
std     2886.89568   1958.365462                            NaN

In [9]:
df[df['amount'] < 0]

,id,description,amount,timestamp,merchant,operation_type,side
0,1,Card expense at EDF,-952.40,2023-11-28 06:35:12,EDF,refund,debit
1,2,Purchase at Amazon.fr,-749.56,2023-05-16 01:27:52,Amazon.fr,transfer,debit
3,4,Incoming transfer,-980.93,2023-06-23 16:24:44,La Poste,direct_debit,debit
6,7,Subscription to Air France,-839.05,2023-04-11 07:30:35,Air France,transfer,debit
7,8,Purchase at Air France,-1148.84,2023-01-05 12:44:46,Air France,payment,debit
...,...,...,...,...,...,...,...
9992,9993,Incoming transfer,-172.20,2023-09-19 01:50:43,RATP,refund,debit
9994,9995,Online payment,-405.88,2023-02-25 04:03:57,Amazon.fr,payment,debit
9997,9998,Outgoing transfer,-1163.01,2023-11-16 10:08:31,Veolia,payment,debit
9998,9999,Card expense at RATP,-624.93,2023-03-25 07:37:43,RATP,direct_debit,debit
9999,10000,Direct debit,-29.34,2023-05-14 17:08:57,Uber,direct_debit,debit

In [11]:
df[(df['amount'] < 0) & (df['side'] != 'debit')]

Empty DataFrame
Columns: [id, description, amount, timestamp, merchant, operation_type, side]
Index: []

In [12]:
df[(df['amount'] > 0) & (df['side'] != 'credit')]

Empty DataFrame
Columns: [id, description, amount, timestamp, merchant, operation_type, side]
Index: []

In [13]:
df['operation_type'].unique()

array(['refund', 'transfer', 'direct_debit', 'payment'], dtype=object)

In [14]:
df['side'].unique()

array(['debit', 'credit'], dtype=object)

In [15]:
df['merchant'].value_counts()

merchant
Bouygues         455
Lidl             449
TotalEnergies    449
Deliveroo        444
SNCF             435
Auchan           433
EDF              428
Uber             427
Carrefour        425
Franprix         420
Air France       417
Amazon.fr        413
Monoprix         412
La Poste         411
Darty            410
Intermarche      410
Fnac             408
Orange           408
Transilien       404
Veolia           401
Systeme U        397
RATP             385
Leclerc          381
SFR              378
Name: count, dtype: int64